{
    "_config_name": "block.custom.upgrade_day",
    "delta": "upgrade_day",
    "info": "upgrade day",
    "title": "Upgrade Day: Get started upgrading your Drupal 7 site to Backdrop!",
    "description": "Upgrade Day",
    "body": {
        "value": "<strong>Date/Time</strong>: [utz-datetime:2021-11-03 9:00 PDT|F j, Y - g:i a] to [utz-datetime:2021-11-03 17:00 PDT| g:i a (e)]<br>\r\n<strong>Cost</strong>: Free<br>\r\n<strong>Location</strong>: <a href=\"https://events.backdropcms.org/zoom\">Zoom link</a><br>\r\n<strong>Registration</strong>: Optional - register to get reminders and updates.<br><br>\r\n<strong>Login information</strong>: Posted here on day of event.<br>\r\n\r\n<h3>Details:</h3>\r\n<ul>\r\n\t<li>[utz-datetime:2021-11-03 9:00 PDT|g:i a (e)] - Presentation on how to upgrade a Drupal 7 site to Backdrop</li>\r\n\t<li>[utz-datetime:2021-11-03 9:00 PDT|g:i a] to [utz-datetime:2021-11-03 17:00 PDT| g:i a (e)] - Live Help Desk</li>\r\n\t<li>[utz-datetime:2021-11-03 9:00 PDT|g:i a] to [utz-datetime:2021-11-03 17:00 PDT| g:i a (e)] Virtual co-working space to collaborate with others engaged in an upgrade</li>\r\n        <li>(Times to be announced later) Live demonstration of Backdrop Upgrade Status module or other useful tools - as needed.</li>\r\n</ul>\r\n\r\n<p><em><strong>This is intended to be a hands-on opportunity for you to start upgrading your Drupal 7 site with Backdrop volunteers available to assist/or answer questions as needed.</strong></em>&nbsp;</p>\r\n\r\n<p>Drupal 7 is reaching end of life in 1 year and will no longer be supported. While many Drupal sites have upgraded to Drupal 8/9, many Drupal 7 site owners are scrambling to find other options. The Backdrop CMS community would like to do everything possible to help those Drupal 7 site owners find a home that is familiar to them.</p>\r\n\r\n<p>Backdrop CMS is remarkably similar to Drupal 7 in many important ways, but comes with a number of improvements including some of the features added to Drupal 8/9. Most importantly, there is an upgrade path to Backdrop from Drupal.&nbsp;</p>\r\n\r\n<p>On November 3rd, members of the Backdrop community will be offering demonstrations, answering questions, and helping folks get started on their upgrade journey. For most folks the upgrade is going to take more than one day, however it only takes one day to get started.&nbsp;</p>\r\n\r\n<p>Bring your Drupal 7 site and we'll show you the tools you need to get started and be there to answer any questions you have.&nbsp;</p>\r\n\r\n<p>Resources:</p>\r\n\r\n<ul>\r\n        <li>Weekly office hours every Wednesday to help answer questions about upgrades - or anything else Backdrop related.</li>\r\n        <li><a href=\"https://forum.backdropcms.org/\">The Backdrop Forum</a> - We will be watching the forum and answering questions as quickly as we can.</li>\r\n\t<li>Video \"<a href=\"https://www.youtube.com/watch?v=E3YhH7Vy9tQ\">Moving from Drupal 7 to Backdrop CMS</a>\" - Stanford Web Camp (April 2020) \"Watch a live upgrade (not a migration) of a Drupal 7 website to Backdrop CMS. You'll get a chance to experience everything that is familiar after the upgrade, and see some of the areas that have been improved. We'll also cover some of the similarities and differences between the Drupal and Backdrop\"</li>\r\n\t<li><a href=\"https://www.drupal.org/project/backdrop_upgrade_status\">Backdrop Upgrade Status Module</a> - A module to install on your Drupal 7 site to help evaluate how ready it is for upgrade.</li>\r\n\t<li>Documentation on <a href=\"https://docs.backdropcms.org/documentation/upgrading-from-drupal-7\">how to upgrade from Drupal 7 to Backdrop</a></li>\r\n\t<li><a href=\"https://backdropcms.org/project/coder_upgrade\">Backdrop Coder Upgrade Module</a> - This is a Backdrop CMS module that will help you port custom or contrib modules to Backdrop.&nbsp;</li>\r\n\t<li>Documentation on <a href=\"https://docs.backdropcms.org/converting-modules-from-drupal\">porting modules from Drupal 7</a></li>\r\n</ul>\r\n<p>\r\n<a href=\"/events/upgrade-your-drupal-7-site-to-backdrop\" class=\"button\">Register Now</a>\r\n</p>\r\n",
        "format": "raw_html_tokens"
    },
    "default_langcode": "und"
}
